; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v8 ?v4)
		(pred_6 ?v2)
		(pred_4 ?v1)
		(pred_3 ?v1)
		(pred_5 ?v2 ?v1)
		(pred_2)
		(pred_1 ?v2))

   (:action op_2
       :parameters  (?v7 ?v5)
       :precondition (and (not-eq ?v7 ?v5) 
                          (pred_4 ?v7) (pred_4 ?v5) (pred_3 ?v7))
       :effect (and  (pred_3 ?v5)
		     (not (pred_3 ?v7))))


   (:action op_1
       :parameters (?v6 ?v3)
       :precondition  (and  (pred_6 ?v6) (pred_4 ?v3)
			    (pred_5 ?v6 ?v3) (pred_3 ?v3) (pred_2))
       :effect (and (pred_1 ?v6)
		    (not (pred_5 ?v6 ?v3)) 
		    (not (pred_2))))

   (:action op_3
       :parameters  (?v6  ?v3)
       :precondition  (and  (pred_6 ?v6) (pred_4 ?v3)
			    (pred_1 ?v6) (pred_3 ?v3))
       :effect (and (pred_5 ?v6 ?v3)
		    (pred_2)
		    (not (pred_1 ?v6)))))

; problem
(define (problem ferry-l4-c2)
(:domain ferry)
(:objects obj_02 obj_01 obj_04 obj_05 
          obj_03 obj_06 
)
(:init
(pred_4 obj_02)
(pred_4 obj_01)
(pred_4 obj_04)
(pred_4 obj_05)
(pred_6 obj_03)
(pred_6 obj_06)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_02)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_01)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_04)
(pred_2)
(pred_5 obj_03 obj_02)
(pred_5 obj_06 obj_05)
(pred_3 obj_02)
)
(:goal
(and
(pred_5 obj_03 obj_01)
(pred_5 obj_06 obj_01)
)
)

(:constraints
  (and
    (sometime-before  (pred_5 obj_03 obj_01) (pred_3 obj_04))
    (sometime-before  (pred_5 obj_06 obj_01) (pred_3 obj_04))
  )
)
)

; plan
1. (op_1 obj_03 obj_02)
   deleted: (pred_5 obj_03 obj_02) (pred_2)
   added: (pred_1 obj_03)
   goals met: 0 of 2
2. (op_2 obj_02 obj_04)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_04)
   goals met: 0 of 2
3. (op_3 obj_03 obj_04)
   deleted: (pred_1 obj_03)
   added: (pred_5 obj_03 obj_04) (pred_2)
   goals met: 0 of 2
4. (op_2 obj_04 obj_05)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_05)
   goals met: 0 of 2
5. (op_1 obj_06 obj_05)
   deleted: (pred_5 obj_06 obj_05) (pred_2)
   added: (pred_1 obj_06)
   goals met: 0 of 2
6. (op_2 obj_05 obj_01)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_01)
   goals met: 0 of 2
7. (op_3 obj_06 obj_01)
   deleted: (pred_1 obj_06)
   added: (pred_5 obj_06 obj_01) (pred_2)
   goals met: 1 of 2
8. (op_2 obj_01 obj_04)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_04)
   goals met: 1 of 2
9. (op_1 obj_03 obj_04)
   deleted: (pred_5 obj_03 obj_04) (pred_2)
   added: (pred_1 obj_03)
   goals met: 1 of 2
10. (op_2 obj_04 obj_01)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_01)
   goals met: 1 of 2
11. (op_3 obj_03 obj_01)
   deleted: (pred_1 obj_03)
   added: (pred_5 obj_03 obj_01) (pred_2)
   goals met: 2 of 2
